blog/2021/remove-files-from-git-history.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 16:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>如何从 Git 仓库中完全移除文件</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">如何从 Git 仓库中完全移除文件</h1>
</header><p>
请注意：不要在重要仓库中尝试，可以先新建一个测试 Git
仓库，以熟悉操作步骤（实际上只有一行命令）。
</p>

<p>
能够达到我的目的的命令<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>：
</p>

<pre class="example" id="org04fed0b">
git filter-branch --index-filter "git rm -rf --cached --ignore-unmatch path_to_file" HEAD
git push -f
</pre>

<p>
当使用 <code>filter-branch</code> 命令时，出现以下提示：
</p>

<pre class="example" id="orgd0b78f4">
WARNING: git-filter-branch has a glut of gotchas generating mangled history
         rewrites.  Hit Ctrl-C before proceeding to abort, then use an
         alternative filtering tool such as 'git filter-repo'
         (https://github.com/newren/git-filter-repo/) instead.  See the
         filter-branch manual page for more details; to squelch this warning,
         set FILTER_BRANCH_SQUELCH_WARNING=1.
</pre>

<p>
大意就是说，=filter-branch= 命令有大量陷阱，会把已有的历史弄乱。按
Ctrl+C 可在未执行命令以前取消，然后使用另一个可供选择的筛选工具
<a href="https://github.com/newren/git-filter-repo">git filter-repo</a>。查看
<code>filter-branch</code> 的手册获取更多信息，略去警告需设置
=FILTER_BRANCH_SQUELCH_WARNING=1=。
</p>

<div id="outline-container-了解-git-filter-repo2" class="outline-2">
<h2 id="了解-git-filter-repo2">了解 <code>git filter-repo</code><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-了解-git-filter-repo2">
<p>
<code>git filter-repo</code> 是一个用于重写 Git 仓库历史的多功能工具。它和
<code>git filter-branch</code>
差不多，但是没有导致性能下降的问题，它的功能更强大，而且它的设计可以扩展可用性，而不是简单的重写情况。=git filter-repo=
现在被 Git 项目推荐，用于代替 =git filter-branch=。
</p>

<pre class="example" id="orgb90917e">
sudo pacman -S git-filter-repo # 安装

### 演示使用方法
git init test_git_filter_repo &amp;&amp; cd $_ # 新建名为 test_git_filter_repo 的 Git 仓库，并打开
touch test # 新建文件
git add test # 添加到暂存区
git commit -m "message" # 提交至 Git 仓库
git log # 检查日志
git filter-repo --path test --force --invert-paths # 删除包含 test 的历史
git log # 检查结果：无 commit 提交
ls -a # 没有文件 test
</pre>

<p>
以上命令行中的演示，是使用 <code>git filter-repo</code>
移除文件的过程，谨记：不要直接在生产环境或重要仓库使用，要先确保自己知道某个命令的执行结果。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://stackoverflow.com/a/52643437">https://stackoverflow.com/a/52643437</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/newren/git-filter-repo">https://github.com/newren/git-filter-repo</a>
</p></div></div>


</div>
</div></div>
</body>
</html>